Билет03/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВВалютеВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОУ</Name>
					<Comment>!! не нужно это делать! (если никак- писать в объяснении</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БУ</Name>
					<Comment>!! не нужно это делать! (если никак- писать в объяснении</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УФ</Name>
					<Comment>!! не нужно это делать! (если никак- писать в объяснении</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыИУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет03/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановитьУчетнуюПолитику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Билет03/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.УФ И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
//		УстановитьСоответствиеОбъектаИРеквизитаФормы(ТекущийОбъект, "Объект");    // Установка соответствия
//		ДействиеСОбъектом(ТекущийОбъект, Отказ);    // Действия над объектом, в процессе работы которых может возникнуть необходимость вывода сообщений
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц	= Новый МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЧ ИЗ &ТаблицаДанных КАК ТЧ";
		Запрос.УстановитьПараметр("ТаблицаДанных", ТекущийОбъект.ТоварыИУслуги.Выгрузить());
		Запрос.Выполнить();

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЧ.Номенклатура КАК Номенклатура,
			|	ТЧ.Количество КАК Количество,
			|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
			|	ПРЕДСТАВЛЕНИЕ(ТЧ.Номенклатура) КАК НоменклатураПредставление,
			|	ТЧ.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	ТЧ КАК ТЧ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
			|				&Дата,
			|				Номенклатура В
			|					(ВЫБРАТЬ
			|						ТЧ.Номенклатура
			|					ИЗ
			|						ТЧ КАК ТЧ)) КАК ОстаткиТоваровОстатки
			|		ПО ТЧ.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
			|ИТОГИ
			|	СУММА(Количество),
			|	МАКСИМУМ(КоличествоОстаток),
			|	МИНИМУМ(НомерСтроки)
			|ПО
			|	НоменклатураПредставление";
		
		Запрос.УстановитьПараметр("Дата", ТекущийОбъект.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			Если ВыборкаНоменклатура.КоличествоОстаток < ВыборкаНоменклатура.Количество Тогда
			    Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст	= СтрШаблон("Не хватает %1 товара %2. В наличии есть только %3", СокрЛП(ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток), ВыборкаНоменклатура.НоменклатураПредставление, СокрЛП(ВыборкаНоменклатура.КоличествоОстаток));
				Сообщение.Поле	= "ТоварыИУслуги["+СокрЛП(ВыборкаНоменклатура.НомерСтроки - 1)+"].Количество";	
				
				// Привязка объекта к реквизиту формы произойдет за счет установленного выше по стеку соответствия методом УстановитьСоответствиеОбъектаИРеквизитаФормы
			    Сообщение.УстановитьДанные(ТекущийОбъект);
			    // Теперь у сообщения заполнено поле ПутьКДанным (установлено имя реквизита формы, до этого была пустая строка),
				// и свойство КлючДанных (установлена ссылка на документ, до этого было Неопределено)

			    Сообщение.Сообщить();
				Отказ	= Истина;
			КонецЕсли; 	
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

// не нужно - без этого все работает
&НаСервере
Процедура ДействиеСОбъектом(ОбъектДанных, Отказ)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц	= Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЧ ИЗ &ТаблицаДанных КАК ТЧ";
	Запрос.УстановитьПараметр("ТаблицаДанных", ОбъектДанных.ТоварыИУслуги.Выгрузить());
	Запрос.Выполнить();

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Количество КАК Количество,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ПРЕДСТАВЛЕНИЕ(ТЧ.Номенклатура) КАК НоменклатураПредставление,
		|	ТЧ.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ТЧ КАК ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&Дата,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						ТЧ.Номенклатура
		|					ИЗ
		|						ТЧ КАК ТЧ)) КАК ОстаткиТоваровОстатки
		|		ПО ТЧ.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(КоличествоОстаток),
		|	МИНИМУМ(НомерСтроки)
		|ПО
		|	НоменклатураПредставление";
	
	Запрос.УстановитьПараметр("Дата", ОбъектДанных.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.КоличествоОстаток < ВыборкаНоменклатура.Количество Тогда
		    Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст	= СтрШаблон("Не хватает %1 товара %2. В наличии есть только %3", СокрЛП(ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток), ВыборкаНоменклатура.НоменклатураПредставление, СокрЛП(ВыборкаНоменклатура.КоличествоОстаток));
			Сообщение.Поле	= "ТоварыИУслуги["+СокрЛП(ВыборкаНоменклатура.НомерСтроки - 1)+"].Количество";	
			
			// Привязка объекта к реквизиту формы произойдет за счет установленного выше по стеку соответствия методом УстановитьСоответствиеОбъектаИРеквизитаФормы
		    Сообщение.УстановитьДанные(ОбъектДанных);
		    // Теперь у сообщения заполнено поле ПутьКДанным (установлено имя реквизита формы, до этого была пустая строка),
			// и свойство КлючДанных (установлена ссылка на документ, до этого было Неопределено)

		    Сообщение.Сообщить();
			Отказ	= Истина;
		КонецЕсли; 	
		
	КонецЦикла;
	
КонецПроцедуры
